//ДЗ 3 день MAVEN
//1.Созданием проект, структура которого основана на maven.
//2.Проект содержит класс, который реализует методы сортировки: пузырьком и
//быстрой сортировкой. 3.Через maven подключаем зависимость на JUnit.
//4.Пишем тесты (в количестве, которое посчитаем нужным).
//5.Показываем запуск сборки в maven в консоли*.
//6.Показываем запуск тестов в maven в консоли*.
//* Логи запуска из консоли прикладываем к заданию в репозиторий GitHub тестовыми
//файлами: run_build.log and run_test.log.

package MAVEN;

public class Task {
}
